Project/Toir/src/Catalogs/торо_КатегорииРиска/торо_КатегорииРиска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_КатегорииРиска</name>
  <attributes>
    <name>КатегорияВероятности</name>
    <type>
      <types>CatalogRef.торо_КатегорииВероятности</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияТяжестиПоследствий</name>
    <type>
      <types>CatalogRef.торо_КатегорииТяжестиПоследствий</types>
    </type>
  </attributes>
  <attributes>
    <name>КритичностьДефекта</name>
    <type>
      <types>CatalogRef.торо_КритичностьДефекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала_КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания_КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлановаяКрайняя_КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала_Период</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания_Период</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлановаяКрайняя_Период</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СтроковоеПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/торо_КатегорииРиска/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(ДатаПлановаяКрайняя_Период) Тогда
		СтроковоеПредставлениеПериода = Строка(ДатаПлановаяКрайняя_КоличествоПериодов) + ВРег(Лев(Строка(ДатаПлановаяКрайняя_Период), 1));
	Иначе
		СтроковоеПредставлениеПериода = "";
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	# Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_КатегорииРиска.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.торо_КатегорииРиска КАК торо_КатегорииРиска
	|ГДЕ
	|	торо_КатегорииРиска.КатегорияВероятности = &КатегорияВероятности
	|	И торо_КатегорииРиска.КатегорияТяжестиПоследствий = &КатегорияТяжестиПоследствий
	|	И НЕ торо_КатегорииРиска.Ссылка = &Ссылка";
	# КонецОбласти
    Запрос.УстановитьПараметр("КатегорияВероятности"       , КатегорияВероятности);
    Запрос.УстановитьПараметр("КатегорияТяжестиПоследствий", КатегорияТяжестиПоследствий);
    Запрос.УстановитьПараметр("Ссылка"                     , Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ШаблонСообщения = НСтр("es='Para una pareja de la categoría de la probabilidad <%1> y las categorías del peso de las consecuencias <%2> hay ya las categorías del riesgo';ru='Для пары категории вероятности <%1> и категории тяжести последствий <%2> уже имеются категории риска';en='For a pair of probability category <%1> and severity category of consequences <%2> there are already risk categories'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, КатегорияВероятности, КатегорияТяжестиПоследствий);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		Если Не ПометкаУдаления Тогда
			Отказ = Истина;
		КонецЕсли; 
		
	КонецЕсли; 
	 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ДатаНачала_КоличествоПериодов) Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаНачала_Период");
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ДатаОкончания_КоличествоПериодов) Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаОкончания_Период");
	КонецЕсли; 

	Если ЗначениеЗаполнено(ДатаПлановаяКрайняя_КоличествоПериодов) Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаПлановаяКрайняя_Период");
	КонецЕсли; 
 
КонецПроцедуры
	
#КонецОбласти
